app/views/OWS/Name/UpdatePhone.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl" xmlns:com="http://webservices.micros.com/og/4.3/Common/">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:UpdatePhoneRequest>
         <name:NamePhone phoneType="{phoneType}" phoneRole="PHONE" operaId="{operaId}">
         	<com:PhoneNumber>{PhoneNumber}</com:PhoneNumber> 
         </name:NamePhone>
      </name:UpdatePhoneRequest>
   </soapenv:Body>
</soapenv:Envelope>